LevelId Property
 The id of the level associated with the element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public ElementId LevelId { get; }
  Visual Basic
Public ReadOnly Property LevelId As ElementId
	Get
  Visual C++
public:
property ElementId^ LevelId {
	ElementId^ get ();
}
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →